* COMMENT work space
#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
#+end_src

#+RESULTS:
| /home/asd/config_storage/cargo/config.toml | /home/asd/config_storage/cargo/copy.sh |

* Script to copy
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./copy.sh
  cd "$(dirname -- "${0}")"
  CARGO_HOME="${HOME}/.cargo"
  mkdir -pv -- "${CARGO_HOME}"
  cp -vf -- './config.toml' "${CARGO_HOME}/config.toml"
#+end_src

* Main config
#+begin_src conf :tangle ./config.toml
  [build]
  rustflags = ["-C","target-cpu=x86-64-v3","-C","link-args=-Wl,-rpath=$ORIGIN/../lib64","-C","link-args=-Wl,--dynamic-linker=/var/tmp/RUST/lib64/ld-linux-x86-64.so.2"]
  incremental = true

  [profile.release]
  opt-level = 3
  debug = false
  strip = true
  overflow-checks = false
  lto = true
  incremental = true
  rpath = false
#+end_src
